---
kind: property
id: P:Autodesk.Revit.DB.ElementStructuralTypeFilter.StructuralType
source: html/6b76b6e9-b334-bae7-bd74-02273f6db108.htm
---
# Autodesk.Revit.DB.ElementStructuralTypeFilter.StructuralType Property

The structural type.

## Syntax (C#)
```csharp
public StructuralType StructuralType { get; }
```